# CHAPTER 03. 데이터 분석 시작

## 데이터 분석 루틴 개발

- head(), shape, info(), describe() 로 데이터 파악. (T (transpose) 활용 가능)

In [36]:
import pandas as pd
import numpy as np

college = pd.read_csv("../data/college.csv")
college.head(3)

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370

In [38]:
college.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   INSTNM              7535 non-null   object
 1   CITY                7535 non-null   object
 2   STABBR              7535 non-null   object
 3   HBCU                7164 non-null   float64
 4   MENONLY             7164 non-null   float64
 5   WOMENONLY           7164 non-null   float64
 6   RELAFFIL            7535 non-null   int64
 7   SATVRMID            1185 non-null   float64
 8   SATMTMID            1196 non-null   float64
 9   DISTANCEONLY        7164 non-null   float64
 10  UGDS                6874 non-null   float64
 11  UGDS_WHITE          6874 non-null   float64
 12  UGDS_BLACK          6874 non-null   float64
 13  UGDS_HISP           6874 non-null   float64
 14  UGDS_ASIAN          6874 non-null   float64
 15  UGDS_AIAN           6874 non-null   float64
 16  UGDS_NHPI           6874 non-null   float64
 17  UGDS_2MOR           6874 non-null   float64
 18  UGDS_NRA            6874 non-null   float64
 19  UGDS_UNKN           6874 non-null   float64
 20  PPTUG_EF            6853 non-null   float64
 21  CURROPER            7535 non-null   int64
 22  PCTPELL             6849 non-null   float64
 23  PCTFLOAN            6849 non-null   float64
 24  UG25ABV             6718 non-null   float64
 25  MD_EARN_WNE_P10     6413 non-null   object
 26  GRAD_DEBT_MDN_SUPP  7503 non-null   object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.6+ MB

In [40]:
college.describe(include=[np.number]).T.head(3)

            count      mean       std  min  25%  50%  75%  max
HBCU       7164.0  0.014238  0.118478  0.0  0.0  0.0  0.0  1.0
MENONLY    7164.0  0.009213  0.095546  0.0  0.0  0.0  0.0  1.0
WOMENONLY  7164.0  0.005304  0.072642  0.0  0.0  0.0  0.0  1.0

In [42]:
college.describe(include=[np.object, pd.Categorical]).T

                   count unique                                 top  freq
INSTNM              7535   7535  Columbia Central University-Caguas     1
CITY                7535   2514                            New York    87
STABBR              7535     59                                  CA   773
MD_EARN_WNE_P10     6413    598                   PrivacySuppressed   822
GRAD_DEBT_MDN_SUPP  7503   2038                   PrivacySuppressed  1510

In [44]:
college_data_dict = pd.read_csv("../data/college_data_dictionary.csv")
college_data_dict[college_data_dict["column_name"] == "RELAFFIL"]

  column_name                description
6    RELAFFIL  0/1 Religious Affiliation

## 데이터 형식 변경을 통한 메모리 절약

In [46]:
col_names = ["RELAFFIL", "SATMTMID", "CURROPER", "INSTNM", "STABBR"]
cols = college.loc[:, col_names]
cols.head(3)

   RELAFFIL  SATMTMID  CURROPER                               INSTNM STABBR
0         0     420.0         1             Alabama A &amp; M University     AL
1         0     565.0         1  University of Alabama at Birmingham     AL
2         1       NaN         1                   Amridge University     AL

In [48]:
cols.dtypes

RELAFFIL       int8
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

In [50]:
original_mem = cols.memory_usage(deep = True)
original_mem

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

In [52]:
cols["RELAFFIL"] = cols["RELAFFIL"].astype(np.int8) # 0, 1 만 가지므로 줄이기

In [54]:
cols.memory_usage(deep=True)

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660699
STABBR      444565
dtype: int64

In [56]:
cols.select_dtypes(include=["object"])

                                                 INSTNM
0                              Alabama A &amp; M University
1                   University of Alabama at Birmingham
2                                    Amridge University
3                   University of Alabama in Huntsville
4                              Alabama State University
...                                                 ...
7530         SAE Institute of Technology  San Francisco
7531                  Rasmussen College - Overland Park
7532  National Personal Training Institute of Cleveland
7533  Bay Area Medical Academy - San Jose Satellite ...
7534            Excel Learning Center-San Antonio South

[7535 rows x 1 columns]

In [58]:
cols.select_dtypes(include=["object"]).nunique()

INSTNM    7535
dtype: int64

In [60]:
cols["STABBR"] = cols["STABBR"].astype("category")

In [62]:
cols.dtypes

RELAFFIL        int8
SATMTMID     float64
CURROPER       int64
INSTNM        object
STABBR      category
dtype: object

In [64]:
new_mem = cols.memory_usage(deep=True)
new_mem

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660699
STABBR       13576
dtype: int64

In [66]:
new_mem / original_mem

Index       1.000000
RELAFFIL    1.000000
SATMTMID    1.000000
CURROPER    1.000000
INSTNM      1.000695
STABBR      0.030538
dtype: float64

- object 열은 줄일 여지가 많음
- nan 값은 float 으로만 표현할 수 있어서 하나라도 있으면 정수형으로 바꾸기 불가능
- RangeIndex 메모리 최소로 사용함.

## 최대에서 최소 선택

In [68]:
movie = pd.read_csv("../data/movie.csv")
movie2 = movie[["movie_title", "imdb_score", "budget"]]
movie2.head(3)

                                movie_title  imdb_score       budget
0                                    Avatar         7.9  237000000.0
1  Pirates of the Caribbean: At World&#39;s End         7.1  300000000.0
2                                   Spectre         6.8  245000000.0

In [70]:
movie2.nlargest(150, "imdb_score").nsmallest(5 ,"budget") # 상위 150개 영화 중 예산 최저 5개 영화

                                movie_title  imdb_score    budget
4846  Peace, Propaganda &amp; the Promised Land         8.3   70000.0
4815              A Charlie Brown Christmas         8.4  150000.0
4804                         Butterfly Girl         8.7  180000.0
4801                     Children of Heaven         8.5  180000.0
4680        Monty Python and the Holy Grail         8.3  229575.0

## 정렬에 의해 각 그룹의 최대 선택

In [72]:
movie2.sort_values("imdb_score").head()

                         movie_title  imdb_score      budget
2789  Justin Bieber: Never Say Never         1.6  13000000.0
1126                      Foodfight!         1.7  65000000.0
2240                  Disaster Movie         1.9  25000000.0
2266    Superbabies: Baby Geniuses 2         1.9  20000000.0
4498             The Helix... Loaded         1.9   1000000.0

In [74]:
movie2.sort_values(["imdb_score","budget"]).head() # 두 열 동시 정렬,

                         movie_title  imdb_score      budget
2789  Justin Bieber: Never Say Never         1.6  13000000.0
1126                      Foodfight!         1.7  65000000.0
4498             The Helix... Loaded         1.9   1000000.0
2266    Superbabies: Baby Geniuses 2         1.9  20000000.0
2240                  Disaster Movie         1.9  25000000.0

In [76]:
movie2.sort_values(["imdb_score", "budget"]).drop_duplicates(subset="imdb_score")
# 섭셋 기준 처음 등장행 하나만 남기고 나머지 날림

                         movie_title  imdb_score      budget
2789  Justin Bieber: Never Say Never         1.6  13000000.0
1126                      Foodfight!         1.7  65000000.0
4498             The Helix... Loaded         1.9   1000000.0
3438               Who&#39;s Your Caddy?         2.0   7000000.0
3595                       Crossover         2.1   5600000.0
...                              ...         ...         ...
2791          The Godfather: Part II         9.0  13000000.0
4312            Kickboxer: Vengeance         9.1  17000000.0
3402                   The Godfather         9.2   6000000.0
1920        The Shawshank Redemption         9.3  25000000.0
2725                Towering Inferno         9.5         NaN

[78 rows x 3 columns]

## sort_values 를 사용해 nlargest를 구현

- 경계값에 같은 값이 여러개 있는 구간이 걸리면 다르게 나올 수 있음, head 와 nlargest 가 동률을 처리하는 방법이 다름

In [78]:
movie2.nlargest(100, "imdb_score").nsmallest(5, "budget")

               movie_title  imdb_score    budget
4804        Butterfly Girl         8.7  180000.0
4801    Children of Heaven         8.5  180000.0
4706          12 Angry Men         8.9  350000.0
4550          A Separation         8.4  500000.0
4636  The Other Dream Team         8.4  500000.0

In [80]:
movie2.sort_values("imdb_score", ascending= False).head(100).sort_values("budget").head(5)

                    movie_title  imdb_score    budget
4815  A Charlie Brown Christmas         8.4  150000.0
4801         Children of Heaven         8.5  180000.0
4804             Butterfly Girl         8.7  180000.0
4706               12 Angry Men         8.9  350000.0
4636       The Other Dream Team         8.4  500000.0

## 추적 지정 주문가 계산

- 주가 상승할 때만 따라가
- 손실을 몇퍼이하로 한정 할 수 있음

In [82]:
import pandas_datareader as pdr 
tsla = pdr.DataReader("tsla", data_source="yahoo", start= "2017-1-1")
tsla

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2017-01-03,44.066002,42.192001,42.972000,43.397999,29616500.0,43.397999
2017-01-04,45.599998,42.862000,42.950001,45.397999,56067500.0,45.397999
2017-01-05,45.495998,44.389999,45.284000,45.349998,29558500.0,45.349998
2017-01-06,46.062000,45.090000,45.386002,45.801998,27639500.0,45.801998
2017-01-09,46.383999,45.599998,45.793999,46.256001,19897500.0,46.256001
...,...,...,...,...,...,...
2020-09-25,408.730011,391.299988,393.470001,407.339996,67208500.0,407.339996
2020-09-28,428.079987,415.549988,424.619995,421.200012,49719600.0,421.200012
2020-09-29,428.500000,411.600006,416.000000,419.070007,50219300.0,419.070007
2020-09-30,433.929993,420.470001,421.320007,429.010010,48145600.0,429.010010
2020-10-01,448.880005,434.420013,440.760010,448.160004,50413600.0,448.160004

In [84]:
tsla_close = tsla["Close"]
tsla_close

Date
2017-01-03     43.397999
2017-01-04     45.397999
2017-01-05     45.349998
2017-01-06     45.801998
2017-01-09     46.256001
                 ...
2020-09-25    407.339996
2020-09-28    421.200012
2020-09-29    419.070007
2020-09-30    429.010010
2020-10-01    448.160004
Name: Close, Length: 944, dtype: float64

In [85]:
tsla_close_cummax = tsla_close.cummax()
tsla_close_cummax

Date
2017-01-03     43.397999
2017-01-04     45.397999
2017-01-05     45.397999
2017-01-06     45.801998
2017-01-09     46.256001
                 ...
2020-09-25    498.320007
2020-09-28    498.320007
2020-09-29    498.320007
2020-09-30    498.320007
2020-10-01    498.320007
Name: Close, Length: 944, dtype: float64

In [86]:
tsla_close_cummax * 0.9 # 손실 10퍼이하로 만드는 추적 지정가

Date
2017-01-03     39.058199
2017-01-04     40.858199
2017-01-05     40.858199
2017-01-06     41.221798
2017-01-09     41.630400
                 ...
2020-09-25    448.488007
2020-09-28    448.488007
2020-09-29    448.488007
2020-09-30    448.488007
2020-10-01    448.488007
Name: Close, Length: 944, dtype: float64